[
  {
    "code": "GALR210214",
    "name": "Gale Reef",
    "length": "4 nights / 5 days",
    "start": "2021-02-14T08:00:00Z",
    "resort": "Emerald Bay, 3 stars",
    "perPerson": "799.00",
    "image": "reef1.jpg",
    "description": "Explore the vibrant marine life of Gale Reef with this 5-day adventure. Stay at the cozy Emerald Bay resort and enjoy daily snorkeling and diving excursions. Perfect for both beginners and experienced divers, this trip offers a chance to see colorful coral reefs and a variety of sea creatures. Relax in the evenings with beachside dining and stunning sunsets."
  },
  {
    "code": "DAWR210315",
    "name": "Dawson's Reef",
    "length": "4 nights / 5 days",
    "start": "2021-03-15T08:00:00Z",
    "resort": "Blue Lagoon, 4 stars",
    "perPerson": "1199.00",
    "image": "reef2.jpg",
    "description": "Dive into the crystal-clear waters of Dawson's Reef, renowned for its abundant marine biodiversity and spectacular underwater landscapes. Stay at the luxurious Blue Lagoon resort, where you'll enjoy top-notch amenities and services. Daily guided dives and snorkeling sessions will allow you to explore vibrant coral gardens and encounter exotic marine life. Evenings are perfect for relaxing by the pool or indulging in gourmet cuisine."
  },
  {
    "code": "CLAR210621",
    "name": "Claire's Reef",
    "length": "4 nights / 5 days",
    "start": "2021-06-21T08:00:00Z",
    "resort": "Coral Sands, 5 stars",
    "perPerson": "1999.00",
    "image": "reef3.jpg",
    "description": "Experience the ultimate in luxury and underwater exploration at Claire's Reef. Stay at the prestigious Coral Sands resort, offering unparalleled comfort and exclusive amenities. This all-inclusive package includes daily diving and snorkeling excursions to the most pristine and secluded parts of the reef. Encounter diverse marine species, explore underwater caves, and enjoy private beach access. End your days with spa treatments and exquisite dining experiences."
  }
]
